from numpy import arange


matr1 = arange(10, 100, 10).reshape(3, 3)
matr2 = arange(15, 100, 10).reshape(3, 3)


# линейная комбинация матриц
# >>> matr1 + matr2
# array([[ 25,  45,  65],
#        [ 85, 105, 125],
#        [145, 165, 185]])


# взвешивание матриц
# >>> matr1 * 0.5
# array([[ 5., 10., 15.],
#        [20., 25., 30.],
#        [35., 40., 45.]])


# линейно-взвешенные комбинации
# >>> matr1 * 0.5 + matr2 * 1
# array([[ 20.,  35.,  50.],
#        [ 65.,  80.,  95.],
#        [110., 125., 140.]])
# >>>
# >>> matr1 * 0.1 + matr2 * 1
# array([[ 16.,  27.,  38.],
#        [ 49.,  60.,  71.],
#        [ 82.,  93., 104.]])
# >>>
# >>> matr1 * 1 + matr2 * 0.2
# array([[ 13.,  25.,  37.],
#        [ 49.,  61.,  73.],
#        [ 85.,  97., 109.]])

