from numpy import array
from numpy.linalg import norm


# четырёхмерный вектор-столбец
x = array([[1, 4, 5, 6]]).T
# >>> x
# array([[1],
#        [4],
#        [5],
#        [6]])
# >>>
# >>> x.shape
# (4, 1)

# двумерный вектор-столбец
y = array([[.3], [-7]])
# >>> y
# array([[ 0.3],
#        [-7. ]])
# >>>
# >>> y.shape
# (2, 1)

# четырёхмерный вектор-строка
z = array([[1, 4, 5, 6]])
# >>> z
# array([[1, 4, 5, 6]])
# >>>
# >>> z.shape
# (1, 4)


v = array([[1, 2]]).T
w = array([[4, -6]]).T

# сложение и вычитание векторов одной размерности и одной ориентации

# >>> v + w
# array([[ 5],
#        [-4]])

# >>> v - w
# array([[-3],
#        [ 8]])


u = array([[3, 4]]).T
# модуль, норма или геометрическая длина вектора
u_norm1 = (sum(n**2 for n in u.flat))**0.5
u_norm2 = norm(u)

# >>> u_norm1 == u_norm2
# np.True_


# единичный (нормированный) вектор

# >>> u * (1 / norm(u))
# array([[0.6],
#        [0.8]])
# >>>
# >>> u / norm(u)
# array([[0.6],
#        [0.8]])
# >>>
# >>> norm(u / norm(u))
# np.float64(1.0)

