{
  "name": "Ferrari_Mercedes_Renault_reckognition",
  "trainable": true,
  "dtype": {
    "module": "keras",
    "class_name": "DTypePolicy",
    "config": {
      "name": "float32"
    },
    "registered_name": null
  },
  "layers": [
    {
      "module": "keras.layers",
      "class_name": "InputLayer",
      "config": {
        "batch_shape": [
          null,
          108,
          192,
          3
        ],
        "dtype": "float32",
        "sparse": false,
        "name": "input_layer"
      },
      "registered_name": null
    },
    {
      "module": "keras.layers",
      "class_name": "Conv2D",
      "config": {
        "name": "low_lvl_features",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "filters": 64,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "groups": 1,
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          108,
          192,
          3
        ]
      }
    },
    {
      "module": "keras.layers",
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "gamma_initializer": {
          "module": "keras.initializers",
          "class_name": "Ones",
          "config": {},
          "registered_name": null
        },
        "moving_mean_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "moving_variance_initializer": {
          "module": "keras.initializers",
          "class_name": "Ones",
          "config": {},
          "registered_name": null
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null,
        "synchronized": false
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          106,
          190,
          64
        ]
      }
    },
    {
      "module": "keras.layers",
      "class_name": "ReLU",
      "config": {
        "name": "re_lu",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "max_value": null,
        "negative_slope": 0.0,
        "threshold": 0.0
      },
      "registered_name": null
    },
    {
      "module": "keras.layers",
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      },
      "registered_name": null
    },
    {
      "module": "keras.layers",
      "class_name": "Conv2D",
      "config": {
        "name": "mid_lvl_features",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "filters": 64,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          53,
          95,
          64
        ]
      }
    },
    {
      "module": "keras.layers",
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d_1",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      },
      "registered_name": null
    },
    {
      "module": "keras.layers",
      "class_name": "Dropout",
      "config": {
        "name": "dropout",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "rate": 0.2,
        "seed": null,
        "noise_shape": null
      },
      "registered_name": null
    },
    {
      "module": "keras.layers",
      "class_name": "Conv2D",
      "config": {
        "name": "high_lvl_features",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "filters": 128,
        "kernel_size": [
          2,
          2
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          26,
          47,
          64
        ]
      }
    },
    {
      "module": "keras.layers",
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d_2",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "pool_size": [
          4,
          4
        ],
        "padding": "valid",
        "strides": [
          4,
          4
        ],
        "data_format": "channels_last"
      },
      "registered_name": null
    },
    {
      "module": "keras.layers",
      "class_name": "Flatten",
      "config": {
        "name": "flatten",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "data_format": "channels_last"
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          6,
          11,
          128
        ]
      }
    },
    {
      "module": "keras.layers",
      "class_name": "Dropout",
      "config": {
        "name": "dropout_1",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "rate": 0.3333333333333333,
        "seed": null,
        "noise_shape": null
      },
      "registered_name": null
    },
    {
      "module": "keras.layers",
      "class_name": "Dense",
      "config": {
        "name": "hidden",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 100,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          8448
        ]
      }
    },
    {
      "module": "keras.layers",
      "class_name": "Dropout",
      "config": {
        "name": "dropout_2",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "rate": 0.4,
        "seed": null,
        "noise_shape": null
      },
      "registered_name": null
    },
    {
      "module": "keras.layers",
      "class_name": "Dense",
      "config": {
        "name": "output",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 3,
        "activation": "softmax",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          100
        ]
      }
    }
  ],
  "build_input_shape": [
    null,
    108,
    192,
    3
  ]
}