msg = 'Python — лучший язык программирования!'
fruits = ['яблоко', 'персик', 'груша', 'дыня', 'абрикос', 'слива']
primes = (1, 3, 5, 7, 9, 11, 13, 17, 19, 23, 29)

# >>> msg[0:6]
# 'Python'
# >>>
# >>> msg[6:9]
# ' — '
# >>>
# >>> msg[6]
# ' '
# >>> msg[7]
# '—'
# >>> msg[8]
# ' '
# >>>
# >>> msg[9:15]
# 'лучший'
# >>>
# >>> msg[16:100]
# 'язык программирования!'
# >>>
# >>> msg[16:]
# 'язык программирования!'
# >>>
# >>> msg[:15]
# 'Python — лучший'
# >>>
# >>> msg[:]
# 'Python — лучший язык программирования!'

# >>> fruits[1:2]
# ['персик']
# >>>
# >>> fruits[5:2]
# []

# >>> primes
# (1, 3, 5, 7, 9, 11, 13, 17, 19, 23, 29)
# >>>
# >>> primes[1:9:2]
# (3, 7, 11, 17)
# >>>
# >>> primes[-1:-5:-1]
# (29, 23, 19, 17)

# >>> fruits
# ['яблоко', 'персик', 'груша', 'дыня', 'абрикос', 'слива']
# >>>
# >>> fruits[::-1]
# ['слива', 'абрикос', 'дыня', 'груша', 'персик', 'яблоко']
# >>>
# >>> fruits[-2:1:-1]
# ['абрикос', 'дыня', 'груша']

