# NoneType
None

# int
16
-10

# float
12.5
.07

# complex
1j
2-2j

# bool
True
False

# str
''
'он сказал: "сегодня холодно"'
"he has said that it's cold"
'''многострочный литерал, 
в котором можно использовать 
любые кавычки: ' "'''
"""литерал, который используется для написания
документаций к функциям, классам и модулям"""
r'c:\networks\top'

# list
[]
[30]
[1, 'два', 3.3]

# tuple
()
('единственный элемент кортежа',)
(1, 2.2, .3)

# set
{54}
{1, 5, 'a'}

# dict
{}
{'ключ 1': 190, 2: 'второй элемент'}

